# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language.

We can think of a DataFrame as a bunch of Series objects put together to share the same index.

Let's use pandas to explore this topic!

In [2]:
import pandas as pd
import numpy as np

In [3]:
from numpy.random import randn
np.random.seed(101)

In [4]:
# Example 1
temp=np.random.randint(low=20,high=100,size=20)
temp

array([31, 90, 83, 95, 29, 97, 60, 24, 83, 60, 80, 84, 25, 32, 60, 69, 28,
       49, 79, 54])

In [5]:
# Or we can define temp as
temp=np.random.randint(20,100,20)
name=np.random.choice(['Akshay',"Arun","Aravind","Ajay"],20)
random=np.random.choice([10,11,13,12,14],20)
a=list(zip(temp,name,random))

In [6]:
df1=pd.DataFrame(data=a,columns=['temp','name','random'])
df1

    temp     name  random
0     64     Ajay      12
1     92     Ajay      13
2     39     Ajay      12
3     30     Ajay      13
4     96   Akshay      12
5     20   Akshay      14
6     93   Akshay      14
7     28  Aravind      12
8     82   Akshay      10
9     56     Arun      13
10    48   Akshay      13
11    83     Ajay      12
12    27     Ajay      11
13    30     Ajay      13
14    72     Arun      13
15    76     Arun      13
16    58   Akshay      14
17    93   Akshay      12
18    72   Akshay      12
19    38     Ajay      13

In [7]:
# Example 2

from numpy.random import randn
np.random.seed(101)

In [8]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [9]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [10]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [11]:
# Pass a list of column names this will select mulitple columns
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [12]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

DataFrame Columns are just Series

In [13]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [14]:
df['new'] = df['W'] + df['Y']

In [15]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

**Removing Columns**

In [16]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
# The change is temporary inorder to make the change permanent
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [18]:
df.drop('new',axis=1,inplace=True)

In [19]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Can also drop rows this way:

In [20]:
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

**Selecting Rows**

In [21]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

we can even select based off of position instead of Row name

In [22]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

**Selecting subset of Rows and columns**

In [23]:
df.loc['B','Y']

-0.8480769834036315

In [24]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

**Set Index**

In [25]:
df.set_index('W',inplace=True)
df

                  X         Y         Z
W
 2.706850  0.628133  0.907969  0.503826
 0.651118 -0.319318 -0.848077  0.605965
-2.018168  0.740122  0.528813 -0.589001
 0.188695 -0.758872 -0.933237  0.955057
 0.190794  1.978757  2.605967  0.683509

In [26]:
df.sort_index(axis=0,ascending=True)

                  X         Y         Z
W
-2.018168  0.740122  0.528813 -0.589001
 0.188695 -0.758872 -0.933237  0.955057
 0.190794  1.978757  2.605967  0.683509
 0.651118 -0.319318 -0.848077  0.605965
 2.706850  0.628133  0.907969  0.503826

In [27]:
df.sort_index(axis=0,ascending=False)

                  X         Y         Z
W
 2.706850  0.628133  0.907969  0.503826
 0.651118 -0.319318 -0.848077  0.605965
 0.190794  1.978757  2.605967  0.683509
 0.188695 -0.758872 -0.933237  0.955057
-2.018168  0.740122  0.528813 -0.589001

In [28]:
df.sort_values(by='X', ascending=False)
df

                  X         Y         Z
W
 2.706850  0.628133  0.907969  0.503826
 0.651118 -0.319318 -0.848077  0.605965
-2.018168  0.740122  0.528813 -0.589001
 0.188695 -0.758872 -0.933237  0.955057
 0.190794  1.978757  2.605967  0.683509

In [29]:
# Set default index as index
df.reset_index(inplace=True)
df

          W         X         Y         Z
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [30]:
df

          W         X         Y         Z
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [31]:
df>0

       W      X      Y      Z
0   True   True   True   True
1   True  False  False   True
2  False   True   True  False
3   True  False  False   True
4   True   True   True   True

In [32]:
df[df>0]

          W         X         Y         Z
0  2.706850  0.628133  0.907969  0.503826
1  0.651118       NaN       NaN  0.605965
2       NaN  0.740122  0.528813       NaN
3  0.188695       NaN       NaN  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [33]:
df[df['W']>0]

          W         X         Y         Z
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [34]:
df[df['W']>0]['Y']

0    0.907969
1   -0.848077
3   -0.933237
4    2.605967
Name: Y, dtype: float64

In [35]:
df[df['W']>0][['Y','X']]

          Y         X
0  0.907969  0.628133
1 -0.848077 -0.319318
3 -0.933237 -0.758872
4  2.605967  1.978757

For two conditions you can use | and & with parenthesis:

In [36]:
df[(df['W']>0) & (df['Y'] > 1)]

          W         X         Y         Z
4  0.190794  1.978757  2.605967  0.683509

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [37]:
df

          W         X         Y         Z
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [38]:
# Reset to default 0,1...n index
df.reset_index()

   index         W         X         Y         Z
0      0  2.706850  0.628133  0.907969  0.503826
1      1  0.651118 -0.319318 -0.848077  0.605965
2      2 -2.018168  0.740122  0.528813 -0.589001
3      3  0.188695 -0.758872 -0.933237  0.955057
4      4  0.190794  1.978757  2.605967  0.683509

In [39]:
newind = 'CA NY WY OR CO'.split()

In [40]:
df['States'] = newind

In [41]:
df

          W         X         Y         Z States
0  2.706850  0.628133  0.907969  0.503826     CA
1  0.651118 -0.319318 -0.848077  0.605965     NY
2 -2.018168  0.740122  0.528813 -0.589001     WY
3  0.188695 -0.758872 -0.933237  0.955057     OR
4  0.190794  1.978757  2.605967  0.683509     CO

In [42]:
df.set_index('States')

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

In [43]:
df

          W         X         Y         Z States
0  2.706850  0.628133  0.907969  0.503826     CA
1  0.651118 -0.319318 -0.848077  0.605965     NY
2 -2.018168  0.740122  0.528813 -0.589001     WY
3  0.188695 -0.758872 -0.933237  0.955057     OR
4  0.190794  1.978757  2.605967  0.683509     CO

In [44]:
df.set_index('States',inplace=True)

In [45]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

## Map

In [46]:
a=[1,2,3,4,5]
b=['a','b','c','d','e']
df=pd.DataFrame(a,b,columns=['A'])
df

   A
a  1
b  2
c  3
d  4
e  5

In [47]:
dmap={1:'one',2:'two',3:'three',4:'four'}

In [48]:
df['A'].map(dmap)

a      one
b      two
c    three
d     four
e      NaN
Name: A, dtype: object

***